## Staging Plan
#### SHA: `30d00460a53bb0037a571a33b06fb7fb24b8ff71`
#### PR: `7`

#### ⚙️  Initialize `success`
#### 🗄️ Workspace ``   
#### 📖 Plan `success`

<details><summary>Show Plan</summary>

```

module.postbuild.aws_lambda_permission.allow_sns_to_call_lambda: Refreshing state... [id=AllowExecutionFromSNS]
module.postbuild.aws_lb_listener.web_front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/reviso-web-alb/8fafc791aca8c444/374846968819bd56]
module.postbuild.aws_ecs_cluster.default: Refreshing state... [id=arn:aws:ecs:us-west-2:533267310428:cluster/reviso]
module.postbuild.aws_acm_certificate.app_cert: Refreshing state... [id=arn:aws:acm:us-west-2:533267310428:certificate/9ec05a10-509a-436a-861b-76248105375f]
module.postbuild.aws_lb_listener.server_front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/reviso-app-alb/32f088b5d021d3df/cefe91f8e917162b]
module.postbuild.aws_lb_listener.www_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/reviso-web-alb/8fafc791aca8c444/82dfd4a9b5f495c0]
module.postbuild.aws_acm_certificate.www_cert: Refreshing state... [id=arn:aws:acm:us-west-2:533267310428:certificate/604ab9c8-59d1-4694-94af-936f2368948f]
module.postbuild.aws_ecs_service.web: Refreshing state... [id=arn:aws:ecs:us-west-2:533267310428:service/reviso/reviso-web]
module.postbuild.aws_lb_listener.server_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/reviso-app-alb/32f088b5d021d3df/4c05718cd6c3d377]
module.postbuild.aws_lb_target_group.web_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:targetgroup/reviso-web-tg/35ee97feb2e64330]
module.postbuild.aws_acm_certificate_validation.www_cert_validation: Refreshing state... [id=2024-02-16 16:37:46.279 +0000 UTC]
module.postbuild.aws_cloudwatch_metric_alarm.high_cpu_utilization: Refreshing state... [id=-reviso-high-cpu-utilization]
module.postbuild.aws_cloudwatch_metric_alarm.low_cpu_utilization: Refreshing state... [id=-reviso-low-cpu-utilization]
module.postbuild.aws_iam_role.lambda_exec: Refreshing state... [id=-reviso-lambda_execution_role]
module.postbuild.aws_cloudwatch_metric_alarm.health_check_failures: Refreshing state... [id=-reviso-health-check-failures]
module.postbuild.aws_ecs_service.server: Refreshing state... [id=arn:aws:ecs:us-west-2:533267310428:service/reviso/reviso-server]
module.postbuild.aws_iam_policy.lambda_sns_policy: Refreshing state... [id=arn:aws:iam::533267310428:policy/-reviso-lambda_sns_policy]
module.postbuild.aws_lambda_function.ecs_alerts: Refreshing state... [id=-reviso-ECSCPUAlerts]
module.postbuild.aws_acm_certificate_validation.app_cert_validation: Refreshing state... [id=2024-06-27 16:03:16.248 +0000 UTC]
module.postbuild.aws_lb.web_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/reviso-web-alb/8fafc791aca8c444]
module.postbuild.aws_lb_target_group.server_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:targetgroup/reviso-server-tg/4ac516f4c27de26f]
module.postbuild.aws_sns_topic.ecs_alerts: Refreshing state... [id=arn:aws:sns:us-west-2:533267310428:-reviso-ecs-cpu-alerts]
module.postbuild.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=-reviso-lambda_execution_role-20250220220734660800000002]
module.postbuild.aws_sns_topic_subscription.lambda_subscription: Refreshing state... [id=arn:aws:sns:us-west-2:533267310428:-reviso-ecs-cpu-alerts:a42eb9d9-1428-4533-81b7-31df1348861b]
module.postbuild.aws_lb.app_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/reviso-app-alb/32f088b5d021d3df]
module.postbuild.aws_ecs_task_definition.server: Refreshing state... [id=reviso-server]
module.postbuild.aws_ecs_task_definition.web: Refreshing state... [id=reviso-web]
module.postbuild.aws_route53_record.app_cert_validation["app.reviso.biz"]: Refreshing state... [id=Z0893527DM29OSHJP7NG__9854a5a67cf79fa1702db63f34edcdbb.app.reviso.biz._CNAME]
module.postbuild.aws_route53_record.www: Refreshing state... [id=Z0893527DM29OSHJP7NG_www.reviso.biz_A]
module.postbuild.aws_route53_record.www_cert_validation["www.reviso.biz"]: Refreshing state... [id=Z0893527DM29OSHJP7NG__eb864fcbfa4ac2cd43a71c82d02521c7.www.reviso.biz._CNAME]
module.postbuild.aws_route53_record.app: Refreshing state... [id=Z0893527DM29OSHJP7NG_app.reviso.biz_A]
module.postbuild_pointy.aws_acm_certificate.www_cert: Refreshing state... [id=arn:aws:acm:us-west-2:533267310428:certificate/bd717904-4407-49ce-a2b9-4cff4411a61b]
module.postbuild_pointy.aws_ecs_cluster.default: Refreshing state... [id=arn:aws:ecs:us-west-2:533267310428:cluster/pointy]
module.postbuild_pointy.aws_iam_role.lambda_exec: Refreshing state... [id=-pointy-lambda_execution_role]
module.postbuild_pointy.aws_iam_policy.lambda_sns_policy: Refreshing state... [id=arn:aws:iam::533267310428:policy/-pointy-lambda_sns_policy]
module.postbuild_pointy.aws_acm_certificate.app_cert: Refreshing state... [id=arn:aws:acm:us-west-2:533267310428:certificate/1472e0e6-f850-44d4-8aa1-d4a4ab90bc66]
module.postbuild_pointy.aws_sns_topic.ecs_alerts: Refreshing state... [id=arn:aws:sns:us-west-2:533267310428:-pointy-ecs-cpu-alerts]
module.postbuild_pointy.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=-pointy-lambda_execution_role-20250220220734220800000001]
module.postbuild_pointy.aws_lambda_function.ecs_alerts: Refreshing state... [id=-pointy-ECSCPUAlerts]
module.postbuild_pointy.aws_route53_record.www_cert_validation["www.test.pointy.ai"]: Refreshing state... [id=Z036564521TUMO3XKOL1V__bbc58cc88f1bbef5f1672734bb3e3b31.www.test.pointy.ai._CNAME]
module.postbuild_pointy.aws_ecs_task_definition.web: Refreshing state... [id=pointy-web]
module.postbuild_pointy.aws_route53_record.app_cert_validation["app.test.pointy.ai"]: Refreshing state... [id=Z036564521TUMO3XKOL1V__b6e4ae139628a416e254bc5d74611182.app.test.pointy.ai._CNAME]
module.postbuild_pointy.aws_lb.app_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/pointy-app-alb/22245f02fa9f475a]
module.postbuild_pointy.aws_lb.web_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/pointy-web-alb/4a61b96ac7b3592d]
module.postbuild_pointy.aws_acm_certificate_validation.www_cert_validation: Refreshing state... [id=2025-02-20 20:13:52.975 +0000 UTC]
module.postbuild_pointy.aws_acm_certificate_validation.app_cert_validation: Refreshing state... [id=2025-02-20 20:13:55.824 +0000 UTC]
module.postbuild_pointy.aws_ecs_task_definition.server: Refreshing state... [id=pointy-server]
module.postbuild_pointy.aws_lambda_permission.allow_sns_to_call_lambda: Refreshing state... [id=AllowExecutionFromSNS]
module.postbuild_pointy.aws_sns_topic_subscription.lambda_subscription: Refreshing state... [id=arn:aws:sns:us-west-2:533267310428:-pointy-ecs-cpu-alerts:05f03a16-b101-43dd-a6e3-10619c7d49d8]
module.postbuild_pointy.aws_route53_record.www: Refreshing state... [id=Z036564521TUMO3XKOL1V_www.test.pointy.ai_A]
module.postbuild_pointy.aws_lb_listener.www_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/pointy-web-alb/4a61b96ac7b3592d/60cb3ee4f67bd714]
module.postbuild_pointy.aws_route53_record.app: Refreshing state... [id=Z036564521TUMO3XKOL1V_app.test.pointy.ai_A]
module.postbuild_pointy.aws_lb_listener.server_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/pointy-app-alb/22245f02fa9f475a/f739ca38124d6010]
module.postbuild_pointy.aws_lb_target_group.server_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:targetgroup/pointy-server-tg/8883e71f215b1894]
module.postbuild_pointy.aws_lb_target_group.web_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:targetgroup/pointy-web-tg/4f5579b8a35681f2]
module.postbuild_pointy.aws_lb_listener.server_front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/pointy-app-alb/22245f02fa9f475a/e65c2cb7718cd08b]
module.postbuild_pointy.aws_lb_listener.web_front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/pointy-web-alb/4a61b96ac7b3592d/08b88ea108aaf6ae]
module.postbuild_pointy.aws_ecs_service.server: Refreshing state... [id=arn:aws:ecs:us-west-2:533267310428:service/pointy/pointy-server]
module.postbuild_pointy.aws_ecs_service.web: Refreshing state... [id=arn:aws:ecs:us-west-2:533267310428:service/pointy/pointy-web]
module.postbuild_pointy.aws_cloudwatch_metric_alarm.health_check_failures: Refreshing state... [id=-pointy-health-check-failures]
module.postbuild_pointy.aws_cloudwatch_metric_alarm.high_cpu_utilization: Refreshing state... [id=-pointy-high-cpu-utilization]
module.postbuild_pointy.aws_cloudwatch_metric_alarm.low_cpu_utilization: Refreshing state... [id=-pointy-low-cpu-utilization]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.postbuild.aws_ecs_task_definition.server has been changed
  ~ resource "aws_ecs_task_definition" "server" {
        id                       = "reviso-server"
      + tags                     = {}
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.postbuild.aws_ecs_task_definition.web has been changed
  ~ resource "aws_ecs_task_definition" "web" {
        id                       = "reviso-web"
      + tags                     = {}
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.postbuild_pointy.aws_ecs_task_definition.server has been changed
  ~ resource "aws_ecs_task_definition" "server" {
        id                       = "pointy-server"
      + tags                     = {}
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.postbuild_pointy.aws_ecs_task_definition.web has been changed
  ~ resource "aws_ecs_task_definition" "web" {
        id                       = "pointy-web"
      + tags                     = {}
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.postbuild.aws_acm_certificate.app_cert will be destroyed
  - resource "aws_acm_certificate" "app_cert" {
      - arn                       = "arn:aws:acm:us-west-2:533267310428:certificate/9ec05a10-509a-436a-861b-76248105375f" -> null
      - domain_name               = "app.reviso.biz" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "app.reviso.biz"
              - resource_record_name  = "_9854a5a67cf79fa1702db63f34edcdbb.app.reviso.biz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_2c1375ee8f986103af27e9afd9f43b80.sdgjtdhdhz.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-west-2:533267310428:certificate/9ec05a10-509a-436a-861b-76248105375f" -> null
      - key_algorithm             = "RSA_2048" -> null
      - not_after                 = "2025-07-26T23:59:59Z" -> null
      - not_before                = "2024-06-27T00:00:00Z" -> null
      - pending_renewal           = false -> null
      - renewal_eligibility       = "ELIGIBLE" -> null
      - renewal_summary           = [] -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [
          - "app.reviso.biz",
        ] -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - type                      = "AMAZON_ISSUED" -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.postbuild.aws_acm_certificate.www_cert will be destroyed
  - resource "aws_acm_certificate" "www_cert" {
      - arn                       = "arn:aws:acm:us-west-2:533267310428:certificate/604ab9c8-59d1-4694-94af-936f2368948f" -> null
      - domain_name               = "www.reviso.biz" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "www.reviso.biz"
              - resource_record_name  = "_eb864fcbfa4ac2cd43a71c82d02521c7.www.reviso.biz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_a9ff26143100c86519b3e24a944e777b.mhbtsbpdnt.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-west-2:533267310428:certificate/604ab9c8-59d1-4694-94af-936f2368948f" -> null
      - key_algorithm             = "RSA_2048" -> null
      - not_after                 = "2026-02-15T23:59:59Z" -> null
      - not_before                = "2025-01-16T00:00:00Z" -> null
      - pending_renewal           = false -> null
      - renewal_eligibility       = "ELIGIBLE" -> null
      - renewal_summary           = [
          - {
              - renewal_status        = "SUCCESS"
              - renewal_status_reason = ""
              - updated_at            = "2025-01-16T01:30:19Z"
            },
        ] -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [
          - "www.reviso.biz",
        ] -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - type                      = "AMAZON_ISSUED" -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.postbuild.aws_acm_certificate_validation.app_cert_validation will be destroyed
  - resource "aws_acm_certificate_validation" "app_cert_validation" {
      - certificate_arn         = "arn:aws:acm:us-west-2:533267310428:certificate/9ec05a10-509a-436a-861b-76248105375f" -> null
      - id                      = "2024-06-27 16:03:16.248 +0000 UTC" -> null
      - validation_record_fqdns = [
          - "_9854a5a67cf79fa1702db63f34edcdbb.app.reviso.biz",
        ] -> null
    }

  # module.postbuild.aws_acm_certificate_validation.www_cert_validation will be destroyed
  - resource "aws_acm_certificate_validation" "www_cert_validation" {
      - certificate_arn         = "arn:aws:acm:us-west-2:533267310428:certificate/604ab9c8-59d1-4694-94af-936f2368948f" -> null
      - id                      = "2024-02-16 16:37:46.279 +0000 UTC" -> null
      - validation_record_fqdns = [
          - "_eb864fcbfa4ac2cd43a71c82d02521c7.www.reviso.biz",
        ] -> null
    }

  # module.postbuild.aws_cloudwatch_metric_alarm.health_check_failures will be destroyed
  - resource "aws_cloudwatch_metric_alarm" "health_check_failures" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:us-west-2:533267310428:-reviso-ecs-cpu-alerts",
        ] -> null
      - alarm_description         = "This metric monitors failed health checks for the ECS service" -> null
      - alarm_name                = "-reviso-health-check-failures" -> null
      - arn                       = "arn:aws:cloudwatch:us-west-2:533267310428:alarm:-reviso-health-check-failures" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {
          - "ClusterName" = "reviso"
          - "ServiceName" = "reviso-server"
        } -> null
      - evaluation_periods        = 1 -> null
      - id                        = "-reviso-health-check-failures" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "HealthCheckFailed" -> null
      - namespace                 = "AWS/ECS" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 1 -> null
      - treat_missing_data        = "missing" -> null
    }

  # module.postbuild.aws_cloudwatch_metric_alarm.high_cpu_utilization will be destroyed
  - resource "aws_cloudwatch_metric_alarm" "high_cpu_utilization" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:us-west-2:533267310428:-reviso-ecs-cpu-alerts",
        ] -> null
      - alarm_description         = "This metric monitors ecs cpu utilization" -> null
      - alarm_name                = "-reviso-high-cpu-utilization" -> null
      - arn                       = "arn:aws:cloudwatch:us-west-2:533267310428:alarm:-reviso-high-cpu-utilization" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {
          - "ClusterName" = "reviso"
          - "ServiceName" = "reviso-server"
        } -> null
      - evaluation_periods        = 2 -> null
      - id                        = "-reviso-high-cpu-utilization" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "CPUUtilization" -> null
      - namespace                 = "AWS/ECS" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 90 -> null
      - treat_missing_data        = "missing" -> null
    }

  # module.postbuild.aws_cloudwatch_metric_alarm.low_cpu_utilization will be destroyed
  - resource "aws_cloudwatch_metric_alarm" "low_cpu_utilization" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:us-west-2:533267310428:-reviso-ecs-cpu-alerts",
        ] -> null
      - alarm_description         = "This metric monitors ecs cpu utilization" -> null
      - alarm_name                = "-reviso-low-cpu-utilization" -> null
      - arn                       = "arn:aws:cloudwatch:us-west-2:533267310428:alarm:-reviso-low-cpu-utilization" -> null
      - comparison_operator       = "LessThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {
          - "ClusterName" = "reviso"
          - "ServiceName" = "reviso-server"
        } -> null
      - evaluation_periods        = 2 -> null
      - id                        = "-reviso-low-cpu-utilization" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "CPUUtilization" -> null
      - namespace                 = "AWS/ECS" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 0 -> null
      - treat_missing_data        = "missing" -> null
    }

  # module.postbuild.aws_ecs_cluster.default will be destroyed
  - resource "aws_ecs_cluster" "default" {
      - arn      = "arn:aws:ecs:us-west-2:533267310428:cluster/reviso" -> null
      - id       = "arn:aws:ecs:us-west-2:533267310428:cluster/reviso" -> null
      - name     = "reviso" -> null
      - tags     = {} -> null
      - tags_all = {} -> null

      - setting {
          - name  = "containerInsights" -> null
          - value = "disabled" -> null
        }
    }

  # module.postbuild.aws_ecs_service.server will be destroyed
  - resource "aws_ecs_service" "server" {
      - availability_zone_rebalancing      = "DISABLED" -> null
      - cluster                            = "arn:aws:ecs:us-west-2:533267310428:cluster/reviso" -> null
      - deployment_maximum_percent         = 200 -> null
      - deployment_minimum_healthy_percent = 100 -> null
      - desired_count                      = 1 -> null
      - enable_ecs_managed_tags            = false -> null
      - enable_execute_command             = false -> null
      - health_check_grace_period_seconds  = 120 -> null
      - iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> null
      - id                                 = "arn:aws:ecs:us-west-2:533267310428:service/reviso/reviso-server" -> null
      - launch_type                        = "FARGATE" -> null
      - name                               = "reviso-server" -> null
      - platform_version                   = "LATEST" -> null
      - propagate_tags                     = "NONE" -> null
      - scheduling_strategy                = "REPLICA" -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - task_definition                    = "arn:aws:ecs:us-west-2:533267310428:task-definition/reviso-server:652" -> null
      - triggers                           = {} -> null
      - wait_for_steady_state              = false -> null

      - deployment_circuit_breaker {
          - enable   = true -> null
          - rollback = true -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer {
          - container_name   = "main" -> null
          - container_port   = 9090 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:533267310428:targetgroup/reviso-server-tg/4ac516f4c27de26f" -> null
        }

      - network_configuration {
          - assign_public_ip = true -> null
          - security_groups  = [
              - "sg-029160a0a87913ec5",
              - "sg-071baecd8ea269589",
            ] -> null
          - subnets          = [
              - "subnet-0c31f46d02c0a1c16",
              - "subnet-0ed325bd0a5406d07",
            ] -> null
        }
    }

  # module.postbuild.aws_ecs_service.web will be destroyed
  - resource "aws_ecs_service" "web" {
      - availability_zone_rebalancing      = "DISABLED" -> null
      - cluster                            = "arn:aws:ecs:us-west-2:533267310428:cluster/reviso" -> null
      - deployment_maximum_percent         = 200 -> null
      - deployment_minimum_healthy_percent = 100 -> null
      - desired_count                      = 1 -> null
      - enable_ecs_managed_tags            = false -> null
      - enable_execute_command             = false -> null
      - health_check_grace_period_seconds  = 0 -> null
      - iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> null
      - id                                 = "arn:aws:ecs:us-west-2:533267310428:service/reviso/reviso-web" -> null
      - launch_type                        = "FARGATE" -> null
      - name                               = "reviso-web" -> null
      - platform_version                   = "LATEST" -> null
      - propagate_tags                     = "NONE" -> null
      - scheduling_strategy                = "REPLICA" -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - task_definition                    = "arn:aws:ecs:us-west-2:533267310428:task-definition/reviso-web:642" -> null
      - triggers                           = {} -> null
      - wait_for_steady_state              = false -> null

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer {
          - container_name   = "main" -> null
          - container_port   = 3000 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:533267310428:targetgroup/reviso-web-tg/35ee97feb2e64330" -> null
        }

      - network_configuration {
          - assign_public_ip = true -> null
          - security_groups  = [
              - "sg-029160a0a87913ec5",
              - "sg-071baecd8ea269589",
            ] -> null
          - subnets          = [
              - "subnet-0c31f46d02c0a1c16",
              - "subnet-0ed325bd0a5406d07",
            ] -> null
        }
    }

  # module.postbuild.aws_ecs_task_definition.server will be destroyed
  - resource "aws_ecs_task_definition" "server" {
      - arn                      = "arn:aws:ecs:us-west-2:533267310428:task-definition/reviso-server:652" -> null
      - arn_without_revision     = "arn:aws:ecs:us-west-2:533267310428:task-definition/reviso-server" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - cpu                   = 256
                  - environment           = []
                  - essential             = true
                  - firelensConfiguration = {
                      - options = {
                          - config-file-type        = "file"
                          - config-file-value       = "/fluent-bit-logtail.conf"
                          - enable-ecs-log-metadata = "true"
                        }
                      - type    = "fluentbit"
                    }
                  - image                 = "betterstack/aws-ecs-fluent-bit:amd64-latest"
                  - memory                = 512
                  - memoryReservation     = 50
                  - mountPoints           = []
                  - name                  = "log_router"
                  - portMappings          = []
                  - secrets               = [
                      - {
                          - name      = "LOGTAIL_SOURCE_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:LOGTAIL_SOURCE_TOKEN::"
                        },
                    ]
                  - systemControls        = []
                  - user                  = "0"
                  - volumesFrom           = []
                },
              - {
                  - environment      = [
                      - {
                          - name  = "ADDR"
                          - value = ":9090"
                        },
                      - {
                          - name  = "ALLOWED_ORIGINS"
                          - value = "https://www.reviso.biz"
                        },
                      - {
                          - name  = "APP_HOST"
                          - value = "https://app.reviso.biz"
                        },
                      - {
                          - name  = "AWS_DYNAMODB_TABLE"
                          - value = "staging-reviso"
                        },
                      - {
                          - name  = "AWS_S3_BUCKET"
                          - value = "stage-reviso-documents"
                        },
                      - {
                          - name  = "AWS_S3_IMAGES_BUCKET"
                          - value = "stage-reviso-images"
                        },
                      - {
                          - name  = "COOKIE_DOMAIN"
                          - value = "reviso.biz"
                        },
                      - {
                          - name  = "EMAIL_DOMAIN"
                          - value = "reviso.biz"
                        },
                      - {
                          - name  = "EMAIL_REGION"
                          - value = "us-west-2"
                        },
                      - {
                          - name  = "ENV"
                          - value = "prod"
                        },
                      - {
                          - name  = "FREEPLAY_ENV"
                          - value = "staging"
                        },
                      - {
                          - name  = "FREEPLAY_PROJECT_ID"
                          - value = "c6c19eb5-fdf8-4b6c-8664-2344443ec657"
                        },
                      - {
                          - name  = "FREEPLAY_URL"
                          - value = "https://reviso.freeplay.ai"
                        },
                      - {
                          - name  = "GOOGLE_REDIRECT_URI"
                          - value = "https://app.reviso.biz/auth/google/callback"
                        },
                      - {
                          - name  = "NODE_ENV"
                          - value = "production"
                        },
                      - {
                          - name  = "OTEL_EXPORTER_OTLP_ENDPOINT"
                          - value = "https://api.honeycomb.io:443"
                        },
                      - {
                          - name  = "OTEL_EXPORTER_OTLP_PROTOCOL"
                          - value = "http/protobuf"
                        },
                      - {
                          - name  = "OTEL_SERVICE_NAME"
                          - value = "reviso-go"
                        },
                      - {
                          - name  = "PUBLIC_POSTHOG_HOST"
                          - value = "https://us.posthog.com"
                        },
                      - {
                          - name  = "WEB_HOST"
                          - value = "https://www.reviso.biz"
                        },
                      - {
                          - name  = "WORKER_ADDR"
                          - value = ":9091"
                        },
                      - {
                          - name  = "WORKER_CONCURRENCY"
                          - value = "2"
                        },
                      - {
                          - name  = "WS_HOST"
                          - value = "wss://app.reviso.biz"
                        },
                    ]
                  - essential        = true
                  - healthCheck      = {
                      - command     = [
                          - "CMD-SHELL",
                          - "curl -f http://localhost:9090/healthcheck || exit 1",
                        ]
                      - interval    = 30
                      - retries     = 10
                      - startPeriod = 60
                      - timeout     = 30
                    }
                  - image            = "533267310428.dkr.ecr.us-west-2.amazonaws.com/reviso-server:cc1454c62ef2418407b313f96049f2aeeee68db8"
                  - logConfiguration = {
                      - logDriver = "awsfirelens"
                    }
                  - mountPoints      = []
                  - name             = "main"
                  - portMappings     = [
                      - {
                          - containerPort = 9090
                          - hostPort      = 9090
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 9091
                          - hostPort      = 9091
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "ANTHROPIC_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:ANTHROPIC_API_KEY::"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:DATABASE_URL::"
                        },
                      - {
                          - name      = "EMAIL_ALLOW_LIST"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:EMAIL_ALLOW_LIST::"
                        },
                      - {
                          - name      = "FREEPLAY_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:FREEPLAY_API_KEY::"
                        },
                      - {
                          - name      = "GOOGLE_APPLICATION_CREDENTIALS"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:GOOGLE_APPLICATION_CREDENTIALS::"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_ID"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:GOOGLE_CLIENT_ID::"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:GOOGLE_CLIENT_SECRET::"
                        },
                      - {
                          - name      = "GOOGLE_CLOUD_LOCATION"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:GOOGLE_CLOUD_LOCATION::"
                        },
                      - {
                          - name      = "GOOGLE_CLOUD_PROJECT"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:GOOGLE_CLOUD_PROJECT::"
                        },
                      - {
                          - name      = "GROQ_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:GROQ_API_KEY::"
                        },
                      - {
                          - name      = "JWT_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:JWT_SECRET::"
                        },
                      - {
                          - name      = "LOOPS_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:LOOPS_TOKEN::"
                        },
                      - {
                          - name      = "OPENAI_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:OPENAI_API_KEY::"
                        },
                      - {
                          - name      = "OTEL_EXPORTER_OTLP_HEADERS"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:OTEL_EXPORTER_OTLP_HEADERS::"
                        },
                      - {
                          - name      = "POSTHOG_SERVER_FEATURE_FLAG_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:POSTHOG_SERVER_FEATURE_FLAG_KEY::"
                        },
                      - {
                          - name      = "PUBLIC_POSTHOG_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:POSTHOG_KEY::"
                        },
                      - {
                          - name      = "REDIS_URL"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:REDIS_URL::"
                        },
                      - {
                          - name      = "SCRAPINGBEE_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:SCRAPINGBEE_API_KEY::"
                        },
                      - {
                          - name      = "SEGMENT_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:SEGMENT_WRITE_KEY::"
                        },
                      - {
                          - name      = "STRIPE_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:STRIPE_API_KEY::"
                        },
                      - {
                          - name      = "STRIPE_WEBHOOK_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:STRIPE_WEBHOOK_SECRET::"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
            ]
        ) -> null
      - cpu                      = "1024" -> null
      - enable_fault_injection   = false -> null
      - execution_role_arn       = "arn:aws:iam::533267310428:role/task_execution_role" -> null
      - family                   = "reviso-server" -> null
      - id                       = "reviso-server" -> null
      - memory                   = "2048" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 652 -> null
      - skip_destroy             = false -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null
      - task_role_arn            = "arn:aws:iam::533267310428:role/ecs_task_role" -> null
      - track_latest             = false -> null

      - runtime_platform {
          - cpu_architecture        = "X86_64" -> null
          - operating_system_family = "LINUX" -> null
        }
    }

  # module.postbuild.aws_ecs_task_definition.web will be destroyed
  - resource "aws_ecs_task_definition" "web" {
      - arn                      = "arn:aws:ecs:us-west-2:533267310428:task-definition/reviso-web:642" -> null
      - arn_without_revision     = "arn:aws:ecs:us-west-2:533267310428:task-definition/reviso-web" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "NEXT_PUBLIC_APP_HOST"
                          - value = "https://app.reviso.biz"
                        },
                      - {
                          - name  = "NEXT_PUBLIC_POSTHOG_HOST"
                          - value = "https://us.posthog.com"
                        },
                      - {
                          - name  = "NEXT_PUBLIC_WS_HOST"
                          - value = "wss://app.reviso.biz"
                        },
                      - {
                          - name  = "NODE_ENV"
                          - value = "prod"
                        },
                      - {
                          - name  = "OTEL_SERVICE_NAME"
                          - value = "next-web"
                        },
                      - {
                          - name  = "WEB_HOST"
                          - value = "https://www.reviso.biz"
                        },
                    ]
                  - essential        = true
                  - image            = "533267310428.dkr.ecr.us-west-2.amazonaws.com/reviso-web:cc1454c62ef2418407b313f96049f2aeeee68db8"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-create-group  = "true"
                          - awslogs-group         = "/ecs/reviso-web/main"
                          - awslogs-region        = "us-west-2"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - mountPoints      = []
                  - name             = "main"
                  - portMappings     = [
                      - {
                          - containerPort = 3000
                          - hostPort      = 3000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "HONEYCOMB_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:HONEYCOMB_API_KEY::"
                        },
                      - {
                          - name      = "NEXT_PUBLIC_GOOGLE_CLIENT_ID"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:GOOGLE_CLIENT_ID::"
                        },
                      - {
                          - name      = "NEXT_PUBLIC_POSTHOG_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:POSTHOG_KEY::"
                        },
                      - {
                          - name      = "NEXT_PUBLIC_SEGMENT_WRITE_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-west-2:533267310428:secret:staging-4YQM26:SEGMENT_WRITE_KEY::"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
            ]
        ) -> null
      - cpu                      = "256" -> null
      - enable_fault_injection   = false -> null
      - execution_role_arn       = "arn:aws:iam::533267310428:role/task_execution_role" -> null
      - family                   = "reviso-web" -> null
      - id                       = "reviso-web" -> null
      - memory                   = "1024" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 642 -> null
      - skip_destroy             = false -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null
      - task_role_arn            = "arn:aws:iam::533267310428:role/ecs_task_role" -> null
      - track_latest             = false -> null

      - runtime_platform {
          - cpu_architecture        = "X86_64" -> null
          - operating_system_family = "LINUX" -> null
        }
    }

  # module.postbuild.aws_iam_policy.lambda_sns_policy will be destroyed
  - resource "aws_iam_policy" "lambda_sns_policy" {
      - arn              = "arn:aws:iam::533267310428:policy/-reviso-lambda_sns_policy" -> null
      - attachment_count = 1 -> null
      - description      = "IAM policy for publishing SNS messages" -> null
      - id               = "arn:aws:iam::533267310428:policy/-reviso-lambda_sns_policy" -> null
      - name             = "-reviso-lambda_sns_policy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAXYKJVM5OG2JUWYAFB" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
    }

  # module.postbuild.aws_iam_role.lambda_exec will be destroyed
  - resource "aws_iam_role" "lambda_exec" {
      - arn                   = "arn:aws:iam::533267310428:role/-reviso-lambda_execution_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-02-20T22:07:34Z" -> null
      - force_detach_policies = false -> null
      - id                    = "-reviso-lambda_execution_role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::533267310428:policy/-reviso-lambda_sns_policy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "-reviso-lambda_execution_role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAXYKJVM5OFU4VWCGIH" -> null
    }

  # module.postbuild.aws_iam_role_policy_attachment.lambda_logs will be destroyed
  - resource "aws_iam_role_policy_attachment" "lambda_logs" {
      - id         = "-reviso-lambda_execution_role-20250220220734660800000002" -> null
      - policy_arn = "arn:aws:iam::533267310428:policy/-reviso-lambda_sns_policy" -> null
      - role       = "-reviso-lambda_execution_role" -> null
    }

  # module.postbuild.aws_lambda_function.ecs_alerts will be destroyed
  - resource "aws_lambda_function" "ecs_alerts" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-west-2:533267310428:function:-reviso-ECSCPUAlerts" -> null
      - code_sha256                    = "2g8k1AiPz8te7lxPNUAfOlC2aYCxqAovb6znC6rNGQA=" -> null
      - filename                       = "../modules/alert_function.zip" -> null
      - function_name                  = "-reviso-ECSCPUAlerts" -> null
      - handler                        = "alert_function.lambda_handler" -> null
      - id                             = "-reviso-ECSCPUAlerts" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:533267310428:function:-reviso-ECSCPUAlerts/invocations" -> null
      - last_modified                  = "2025-03-08T00:10:54.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-west-2:533267310428:function:-reviso-ECSCPUAlerts:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:533267310428:function:-reviso-ECSCPUAlerts:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::533267310428:role/-reviso-lambda_execution_role" -> null
      - runtime                        = "python3.8" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "2g8k1AiPz8te7lxPNUAfOlC2aYCxqAovb6znC6rNGQA=" -> null
      - source_code_size               = 728 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "SLACK_WEBHOOK_URL" = "https://hooks.slack.com/services/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"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format = "Text" -> null
          - log_group  = "/aws/lambda/-reviso-ECSCPUAlerts" -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.postbuild.aws_lambda_permission.allow_sns_to_call_lambda will be destroyed
  - resource "aws_lambda_permission" "allow_sns_to_call_lambda" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "-reviso-ECSCPUAlerts" -> null
      - id            = "AllowExecutionFromSNS" -> null
      - principal     = "sns.amazonaws.com" -> null
      - source_arn    = "arn:aws:sns:us-west-2:533267310428:-reviso-ecs-cpu-alerts" -> null
      - statement_id  = "AllowExecutionFromSNS" -> null
    }

  # module.postbuild.aws_lb.app_alb will be destroyed
  - resource "aws_lb" "app_alb" {
      - arn                                         = "arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/reviso-app-alb/32f088b5d021d3df" -> null
      - arn_suffix                                  = "app/reviso-app-alb/32f088b5d021d3df" -> null
      - client_keep_alive                           = 3600 -> null
      - desync_mitigation_mode                      = "defensive" -> null
      - dns_name                                    = "reviso-app-alb-2067745558.us-west-2.elb.amazonaws.com" -> null
      - drop_invalid_header_fields                  = false -> null
      - enable_cross_zone_load_balancing            = true -> null
      - enable_deletion_protection                  = false -> null
      - enable_http2                                = true -> null
      - enable_tls_version_and_cipher_suite_headers = false -> null
      - enable_waf_fail_open                        = false -> null
      - enable_xff_client_port                      = false -> null
      - enable_zonal_shift                          = false -> null
      - id                                          = "arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/reviso-app-alb/32f088b5d021d3df" -> null
      - idle_timeout                                = 60 -> null
      - internal                                    = false -> null
      - ip_address_type                             = "ipv4" -> null
      - load_balancer_type                          = "application" -> null
      - name                                        = "reviso-app-alb" -> null
      - preserve_host_header                        = false -> null
      - security_groups                             = [
          - "sg-029160a0a87913ec5",
        ] -> null
      - subnets                                     = [
          - "subnet-0c31f46d02c0a1c16",
          - "subnet-0ed325bd0a5406d07",
        ] -> null
      - tags                                        = {} -> null
      - tags_all                                    = {} -> null
      - vpc_id                                      = "vpc-031c9e9fe39bf5dd8" -> null
      - xff_header_processing_mode                  = "append" -> null
      - zone_id                                     = "Z1H1FL5HABSF5" -> null

      - access_logs {
          - enabled = false -> null
        }

      - connection_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-0c31f46d02c0a1c16" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0ed325bd0a5406d07" -> null
        }
    }

  # module.postbuild.aws_lb.web_alb will be destroyed
  - resource "aws_lb" "web_alb" {
      - arn                                         = "arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/reviso-web-alb/8fafc791aca8c444" -> null
      - arn_suffix                                  = "app/reviso-web-alb/8fafc791aca8c444" -> null
      - client_keep_alive                           = 3600 -> null
      - desync_mitigation_mode                      = "defensive" -> null
      - dns_name                                    = "reviso-web-alb-24496488.us-west-2.elb.amazonaws.com" -> null
      - drop_invalid_header_fields                  = false -> null
      - enable_cross_zone_load_balancing            = true -> null
      - enable_deletion_protection                  = false -> null
      - enable_http2                                = true -> null
      - enable_tls_version_and_cipher_suite_headers = false -> null
      - enable_waf_fail_open                        = false -> null
      - enable_xff_client_port                      = false -> null
      - enable_zonal_shift                          = false -> null
      - id                                          = "arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/reviso-web-alb/8fafc791aca8c444" -> null
      - idle_timeout                                = 60 -> null
      - internal                                    = false -> null
      - ip_address_type                             = "ipv4" -> null
      - load_balancer_type                          = "application" -> null
      - name                                        = "reviso-web-alb" -> null
      - preserve_host_header                        = false -> null
      - security_groups                             = [
          - "sg-029160a0a87913ec5",
        ] -> null
      - subnets                                     = [
          - "subnet-0c31f46d02c0a1c16",
          - "subnet-0ed325bd0a5406d07",
        ] -> null
      - tags                                        = {} -> null
      - tags_all                                    = {} -> null
      - vpc_id                                      = "vpc-031c9e9fe39bf5dd8" -> null
      - xff_header_processing_mode                  = "append" -> null
      - zone_id                                     = "Z1H1FL5HABSF5" -> null

      - access_logs {
          - enabled = false -> null
        }

      - connection_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-0c31f46d02c0a1c16" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0ed325bd0a5406d07" -> null
        }
    }

  # module.postbuild.aws_lb_listener.server_front_end will be destroyed
  - resource "aws_lb_listener" "server_front_end" {
      - arn                                  = "arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/reviso-app-alb/32f088b5d021d3df/cefe91f8e917162b" -> null
      - certificate_arn                      = "arn:aws:acm:us-west-2:533267310428:certificate/9ec05a10-509a-436a-861b-76248105375f" -> null
      - id                                   = "arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/reviso-app-alb/32f088b5d021d3df/cefe91f8e917162b" -> null
      - load_balancer_arn                    = "arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/reviso-app-alb/32f088b5d021d3df" -> null
      - port                                 = 443 -> null
      - protocol                             = "HTTPS" -> null
      - routing_http_response_server_enabled = false -> null
      - ssl_policy                           = "ELBSecurityPolicy-2016-08" -> null
      - tags                                 = {} -> null
      - tags_all                             = {} -> null

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:533267310428:targetgroup/reviso-server-tg/4ac516f4c27de26f" -> null
          - type             = "forward" -> null
        }

      - mutual_authentication {
          - ignore_client_certificate_expiry = false -> null
          - mode                             = "off" -> null
        }
    }

  # module.postbuild.aws_lb_listener.server_redirect will be destroyed
  - resource "aws_lb_listener" "server_redirect" {
      - arn                                  = "arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/reviso-app-alb/32f088b5d021d3df/4c05718cd6c3d377" -> null
      - id                                   = "arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/reviso-app-alb/32f088b5d021d3df/4c05718cd6c3d377" -> null
      - load_balancer_arn                    = "arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/reviso-app-alb/32f088b5d021d3df" -> null
      - port                                 = 80 -> null
      - protocol                             = "HTTP" -> null
      - routing_http_response_server_enabled = false -> null
      - tags                                 = {} -> null
      - tags_all                             = {} -> null

      - default_action {
          - order = 1 -> null
          - type  = "redirect" -> null

          - redirect {
              - host        = "#{host}" -> null
              - path        = "/#{path}" -> null
              - port        = "443" -> null
              - protocol    = "HTTPS" -> null
              - query       = "#{query}" -> null
              - status_code = "HTTP_301" -> null
            }
        }
    }

  # module.postbuild.aws_lb_listener.web_front_end will be destroyed
  - resource "aws_lb_listener" "web_front_end" {
      - arn                                  = "arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/reviso-web-alb/8fafc791aca8c444/374846968819bd56" -> null
      - certificate_arn                      = "arn:aws:acm:us-west-2:533267310428:certificate/604ab9c8-59d1-4694-94af-936f2368948f" -> null
      - id                                   = "arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/reviso-web-alb/8fafc791aca8c444/374846968819bd56" -> null
      - load_balancer_arn                    = "arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/reviso-web-alb/8fafc791aca8c444" -> null
      - port                                 = 443 -> null
      - protocol                             = "HTTPS" -> null
      - routing_http_response_server_enabled = false -> null
      - ssl_policy                           = "ELBSecurityPolicy-2016-08" -> null
      - tags                                 = {} -> null
      - tags_all                             = {} -> null

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:533267310428:targetgroup/reviso-web-tg/35ee97feb2e64330" -> null
          - type             = "forward" -> null
        }

      - mutual_authentication {
          - ignore_client_certificate_expiry = false -> null
          - mode                             = "off" -> null
        }
    }

  # module.postbuild.aws_lb_listener.www_redirect will be destroyed
  - resource "aws_lb_listener" "www_redirect" {
      - arn                                  = "arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/reviso-web-alb/8fafc791aca8c444/82dfd4a9b5f495c0" -> null
      - id                                   = "arn:aws:elasticloadbalancing:us-west-2:533267310428:listener/app/reviso-web-alb/8fafc791aca8c444/82dfd4a9b5f495c0" -> null
      - load_balancer_arn                    = "arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/reviso-web-alb/8fafc791aca8c444" -> null
      - port                                 = 80 -> null
      - protocol                             = "HTTP" -> null
      - routing_http_response_server_enabled = false -> null
      - tags                                 = {} -> null
      - tags_all                             = {} -> null

      - default_action {
          - order = 1 -> null
          - type  = "redirect" -> null

          - redirect {
              - host        = "#{host}" -> null
              - path        = "/#{path}" -> null
              - port        = "443" -> null
              - protocol    = "HTTPS" -> null
              - query       = "#{query}" -> null
              - status_code = "HTTP_301" -> null
            }
        }
    }

  # module.postbuild.aws_lb_target_group.server_tg will be destroyed
  - resource "aws_lb_target_group" "server_tg" {
      - arn                                = "arn:aws:elasticloadbalancing:us-west-2:533267310428:targetgroup/reviso-server-tg/4ac516f4c27de26f" -> null
      - arn_suffix                         = "targetgroup/reviso-server-tg/4ac516f4c27de26f" -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:us-west-2:533267310428:targetgroup/reviso-server-tg/4ac516f4c27de26f" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/reviso-app-alb/32f088b5d021d3df",
        ] -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - load_balancing_anomaly_mitigation  = "off" -> null
      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
      - name                               = "reviso-server-tg" -> null
      - port                               = 9090 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-031c9e9fe39bf5dd8" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 3 -> null
          - interval            = 60 -> null
          - matcher             = "200-399" -> null
          - path                = "/" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 30 -> null
          - unhealthy_threshold = 3 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}

      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }

          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      - target_health_state {}
    }

  # module.postbuild.aws_lb_target_group.web_tg will be destroyed
  - resource "aws_lb_target_group" "web_tg" {
      - arn                                = "arn:aws:elasticloadbalancing:us-west-2:533267310428:targetgroup/reviso-web-tg/35ee97feb2e64330" -> null
      - arn_suffix                         = "targetgroup/reviso-web-tg/35ee97feb2e64330" -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:us-west-2:533267310428:targetgroup/reviso-web-tg/35ee97feb2e64330" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:us-west-2:533267310428:loadbalancer/app/reviso-web-alb/8fafc791aca8c444",
        ] -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - load_balancing_anomaly_mitigation  = "off" -> null
      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
      - name                               = "reviso-web-tg" -> null
      - port                               = 3000 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-031c9e9fe39bf5dd8" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 3 -> null
          - interval            = 60 -> null
          - matcher             = "200-399" -> null
          - path                = "/" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 30 -> null
          - unhealthy_threshold = 3 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}

      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }

          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      - target_health_state {}
    }

  # module.postbuild.aws_route53_record.app will be destroyed
  - resource "aws_route53_record" "app" {
      - fqdn                             = "app.reviso.biz" -> null
      - id                               = "Z0893527DM29OSHJP7NG_app.reviso.biz_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "app.reviso.biz" -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z0893527DM29OSHJP7NG" -> null

      - alias {
          - evaluate_target_health = true -> null
          - name                   = "reviso-app-alb-2067745558.us-west-2.elb.amazonaws.com" -> null
          - zone_id                = "Z1H1FL5HABSF5" -> null
        }
    }

  # module.postbuild.aws_route53_record.app_cert_validation["app.reviso.biz"] will be destroyed
  - resource "aws_route53_record" "app_cert_validation" {
      - fqdn                             = "_9854a5a67cf79fa1702db63f34edcdbb.app.reviso.biz" -> null
      - id                               = "Z0893527DM29OSHJP7NG__9854a5a67cf79fa1702db63f34edcdbb.app.reviso.biz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_9854a5a67cf79fa1702db63f34edcdbb.app.reviso.biz" -> null
      - records                          = [
          - "_2c1375ee8f986103af27e9afd9f43b80.sdgjtdhdhz.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z0893527DM29OSHJP7NG" -> null
    }

  # module.postbuild.aws_route53_record.www will be destroyed
  - resource "aws_route53_record" "www" {
      - fqdn                             = "www.reviso.biz" -> null
      - id                               = "Z0893527DM29OSHJP7NG_www.reviso.biz_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "www.reviso.biz" -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z0893527DM29OSHJP7NG" -> null

      - alias {
          - evaluate_target_health = true -> null
          - name                   = "reviso-web-alb-24496488.us-west-2.elb.amazonaws.com" -> null
          - zone_id                = "Z1H1FL5HABSF5" -> null
        }
    }

  # module.postbuild.aws_route53_record.www_cert_validation["www.reviso.biz"] will be destroyed
  - resource "aws_route53_record" "www_cert_validation" {
      - fqdn                             = "_eb864fcbfa4ac2cd43a71c82d02521c7.www.reviso.biz" -> null
      - id                               = "Z0893527DM29OSHJP7NG__eb864fcbfa4ac2cd43a71c82d02521c7.www.reviso.biz._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_eb864fcbfa4ac2cd43a71c82d02521c7.www.reviso.biz" -> null
      - records                          = [
          - "_a9ff26143100c86519b3e24a944e777b.mhbtsbpdnt.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z0893527DM29OSHJP7NG" -> null
    }

  # module.postbuild.aws_sns_topic.ecs_alerts will be destroyed
  - resource "aws_sns_topic" "ecs_alerts" {
      - application_success_feedback_sample_rate = 0 -> null
      - arn                                      = "arn:aws:sns:us-west-2:533267310428:-reviso-ecs-cpu-alerts" -> null
      - content_based_deduplication              = false -> null
      - fifo_topic                               = false -> null
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      - id                                       = "arn:aws:sns:us-west-2:533267310428:-reviso-ecs-cpu-alerts" -> null
      - lambda_success_feedback_sample_rate      = 0 -> null
      - name                                     = "-reviso-ecs-cpu-alerts" -> null
      - owner                                    = "533267310428" -> null
      - policy                                   = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - AWS:SourceOwner = "533267310428"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:us-west-2:533267310428:-reviso-ecs-cpu-alerts"
                      - Sid       = "__default_statement_ID"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - signature_version                        = 0 -> null
      - sqs_success_feedback_sample_rate         = 0 -> null
      - tags                                     = {} -> null
      - tags_all                                 = {} -> null
    }

  # module.postbuild.aws_sns_topic_subscription.lambda_subscription will be destroyed
  - resource "aws_sns_topic_subscription" "lambda_subscription" {
      - arn                             = "arn:aws:sns:us-west-2:533267310428:-reviso-ecs-cpu-alerts:a42eb9d9-1428-4533-81b7-31df1348861b" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = true -> null
      - endpoint                        = "arn:aws:lambda:us-west-2:533267310428:function:-reviso-ECSCPUAlerts" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:us-west-2:533267310428:-reviso-ecs-cpu-alerts:a42eb9d9-1428-4533-81b7-31df1348861b" -> null
      - owner_id                        = "533267310428" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "lambda" -> null
      - raw_message_delivery            = false -> null
      - topic_arn                       = "arn:aws:sns:us-west-2:533267310428:-reviso-ecs-cpu-alerts" -> null
    }

  # module.postbuild_pointy.aws_ecs_service.server will be updated in-place
  ~ resource "aws_ecs_service" "server" {
        id                                 = "arn:aws:ecs:us-west-2:533267310428:service/pointy/pointy-server"
        name                               = "pointy-server"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-server:11" -> (known after apply)
        # (16 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.postbuild_pointy.aws_ecs_service.web will be updated in-place
  ~ resource "aws_ecs_service" "web" {
        id                                 = "arn:aws:ecs:us-west-2:533267310428:service/pointy/pointy-web"
        name                               = "pointy-web"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-web:11" -> (known after apply)
        # (16 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.postbuild_pointy.aws_ecs_task_definition.server must be replaced
-/+ resource "aws_ecs_task_definition" "server" {
      ~ arn                      = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-server:11" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-server" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - environment           = [] -> null
                  - mountPoints           = [] -> null
                  - portMappings          = [] -> null
                  - systemControls        = [] -> null
                  - user                  = "0" -> null
                  - volumesFrom           = [] -> null
                    # (8 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  ~ image            = "533267310428.dkr.ecr.us-west-2.amazonaws.com/pointy-server:cc1454c62ef2418407b313f96049f2aeeee68db8" -> "533267310428.dkr.ecr.us-west-2.amazonaws.com/pointy-server:30d00460a53bb0037a571a33b06fb7fb24b8ff71"
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp" -> null
                            # (2 unchanged elements hidden)
                        },
                      ~ {
                          - protocol      = "tcp" -> null
                            # (2 unchanged elements hidden)
                        },
                    ]
                  - systemControls   = [] -> null
                  - volumesFrom      = [] -> null
                    # (6 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "pointy-server" -> (known after apply)
      ~ revision                 = 11 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.postbuild_pointy.aws_ecs_task_definition.web must be replaced
-/+ resource "aws_ecs_task_definition" "web" {
      ~ arn                      = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-web:11" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-web" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ image            = "533267310428.dkr.ecr.us-west-2.amazonaws.com/pointy-web:cc1454c62ef2418407b313f96049f2aeeee68db8" -> "533267310428.dkr.ecr.us-west-2.amazonaws.com/pointy-web:30d00460a53bb0037a571a33b06fb7fb24b8ff71"
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp" -> null
                            # (2 unchanged elements hidden)
                        },
                    ]
                  - systemControls   = [] -> null
                  - volumesFrom      = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "pointy-web" -> (known after apply)
      ~ revision                 = 11 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.redirect_reviso.aws_acm_certificate.old_domain_cert will be created
  + resource "aws_acm_certificate" "old_domain_cert" {
      + arn                       = (known after apply)
      + domain_name               = "reviso.biz"
      + domain_validation_options = [
          + {
              + domain_name           = "app.reviso.biz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "reviso.biz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "www.reviso.biz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "app.reviso.biz",
          + "reviso.biz",
          + "www.reviso.biz",
        ]
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = (known after apply)
        }
    }

  # module.redirect_reviso.aws_acm_certificate_validation.old_domain_cert_validation will be created
  + resource "aws_acm_certificate_validation" "old_domain_cert_validation" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.redirect_reviso.aws_lb.redirect_alb will be created
  + resource "aws_lb" "redirect_alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "reviso-biz-redirect-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-029160a0a87913ec5",
        ]
      + subnets                                                      = [
          + "subnet-0c31f46d02c0a1c16",
          + "subnet-0ed325bd0a5406d07",
        ]
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.redirect_reviso.aws_lb_listener.http_redirect will be created
  + resource "aws_lb_listener" "http_redirect" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Not Found"
              + status_code  = "404"
            }
        }

      + mutual_authentication {
          + advertise_trust_store_ca_names   = (known after apply)
          + ignore_client_certificate_expiry = (known after apply)
          + mode                             = (known after apply)
          + trust_store_arn                  = (known after apply)
        }
    }

  # module.redirect_reviso.aws_lb_listener.https_redirect will be created
  + resource "aws_lb_listener" "https_redirect" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-2016-08"
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Not Found"
              + status_code  = "404"
            }
        }

      + mutual_authentication {
          + advertise_trust_store_ca_names   = (known after apply)
          + ignore_client_certificate_expiry = (known after apply)
          + mode                             = (known after apply)
          + trust_store_arn                  = (known after apply)
        }
    }

  # module.redirect_reviso.aws_lb_listener_rule.http_app_domain_redirect will be created
  + resource "aws_lb_listener_rule" "http_app_domain_redirect" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 30
      + tags_all     = (known after apply)

      + action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "app.test.pointy.ai"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + condition {
          + host_header {
              + values = [
                  + "app.reviso.biz",
                ]
            }
        }
    }

  # module.redirect_reviso.aws_lb_listener_rule.http_root_domain_redirect will be created
  + resource "aws_lb_listener_rule" "http_root_domain_redirect" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 10
      + tags_all     = (known after apply)

      + action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "test.pointy.ai"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + condition {
          + host_header {
              + values = [
                  + "reviso.biz",
                ]
            }
        }
    }

  # module.redirect_reviso.aws_lb_listener_rule.http_www_domain_redirect will be created
  + resource "aws_lb_listener_rule" "http_www_domain_redirect" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 20
      + tags_all     = (known after apply)

      + action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "www.test.pointy.ai"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + condition {
          + host_header {
              + values = [
                  + "www.reviso.biz",
                ]
            }
        }
    }

  # module.redirect_reviso.aws_lb_listener_rule.https_app_domain_redirect will be created
  + resource "aws_lb_listener_rule" "https_app_domain_redirect" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 30
      + tags_all     = (known after apply)

      + action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "app.test.pointy.ai"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + condition {
          + host_header {
              + values = [
                  + "app.reviso.biz",
                ]
            }
        }
    }

  # module.redirect_reviso.aws_lb_listener_rule.https_root_domain_redirect will be created
  + resource "aws_lb_listener_rule" "https_root_domain_redirect" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 10
      + tags_all     = (known after apply)

      + action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "test.pointy.ai"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + condition {
          + host_header {
              + values = [
                  + "reviso.biz",
                ]
            }
        }
    }

  # module.redirect_reviso.aws_lb_listener_rule.https_www_domain_redirect will be created
  + resource "aws_lb_listener_rule" "https_www_domain_redirect" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 20
      + tags_all     = (known after apply)

      + action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "www.test.pointy.ai"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + condition {
          + host_header {
              + values = [
                  + "www.reviso.biz",
                ]
            }
        }
    }

  # module.redirect_reviso.aws_lb_target_group.dummy_tg will be created
  + resource "aws_lb_target_group" "dummy_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "reviso-biz-dummy-tg"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-031c9e9fe39bf5dd8"

      + health_check {
          + enabled             = false
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }

      + target_group_health {
          + dns_failover {
              + minimum_healthy_targets_count      = (known after apply)
              + minimum_healthy_targets_percentage = (known after apply)
            }

          + unhealthy_state_routing {
              + minimum_healthy_targets_count      = (known after apply)
              + minimum_healthy_targets_percentage = (known after apply)
            }
        }

      + target_health_state {
          + enable_unhealthy_connection_termination = (known after apply)
          + unhealthy_draining_interval             = (known after apply)
        }
    }

  # module.redirect_reviso.aws_route53_record.old_app_domain will be created
  + resource "aws_route53_record" "old_app_domain" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "app.reviso.biz"
      + type            = "A"
      + zone_id         = "Z0893527DM29OSHJP7NG"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.redirect_reviso.aws_route53_record.old_domain_cert_validation["app.reviso.biz"] will be created
  + resource "aws_route53_record" "old_domain_cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0893527DM29OSHJP7NG"
    }

  # module.redirect_reviso.aws_route53_record.old_domain_cert_validation["reviso.biz"] will be created
  + resource "aws_route53_record" "old_domain_cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0893527DM29OSHJP7NG"
    }

  # module.redirect_reviso.aws_route53_record.old_domain_cert_validation["www.reviso.biz"] will be created
  + resource "aws_route53_record" "old_domain_cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0893527DM29OSHJP7NG"
    }

  # module.redirect_reviso.aws_route53_record.old_root_domain will be created
  + resource "aws_route53_record" "old_root_domain" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "reviso.biz"
      + type            = "A"
      + zone_id         = "Z0893527DM29OSHJP7NG"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.redirect_reviso.aws_route53_record.old_web_domain will be created
  + resource "aws_route53_record" "old_web_domain" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.reviso.biz"
      + type            = "A"
      + zone_id         = "Z0893527DM29OSHJP7NG"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

Plan: 20 to add, 2 to change, 33 to destroy.

Changes to Outputs:
  - app_host                              = "http://app.reviso.biz" -> null
  - ecs_deployment_task_definition        = "arn:aws:ecs:us-west-2:533267310428:task-definition/reviso-server:652" -> null
  ~ pointy_ecs_deployment_task_definition = "arn:aws:ecs:us-west-2:533267310428:task-definition/pointy-server:11" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...


```

</details>

*Pushed by: @fivetentaylor, Action: `pull_request`*